app/controllers/products_controller.rb

 def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "describe", "updated_at", "foto", "category_id", "vendor") VALUES('ewe', 22.0, '2010-08-16 07:07:10', NULL, '2010-08-16 07:07:10', 'wew', 1, 'wewe')